xtee6/common-test/src/test/resources/sdsbDoclit2.request

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd" xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="MEMBER">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>riigiasutus</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
            <id:subsystemCode>subClient</id:subsystemCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>riigiasutus</id:memberClass>
            <id:memberCode>producer</id:memberCode>
            <id:subsystemCode>subService</id:subsystemCode>
            <id:serviceCode>bodyMassIndex</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </sdsb:service>
        <sdsb:userId>EE37702211234</sdsb:userId>
        <sdsb:id>1234567890</sdsb:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:bodyMassIndex xmlns:ns1="http://consumer.ee.x-rd.net">
            <request>
                <height>180</height>
                <weight>80.1</weight>
            </request>
        </ns1:bodyMassIndex>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
